export default {
  translations: {
    intro: {
      title: 'Ярослав - фронтенд-разработчик с более чем 2-летним опытом и страстью к дизайну и веб-интерфейсам.',
      subtitle: 'Родом из Гродно, живущий в Порту. Источник вдохновения: фильмы, игры и семья.'
    },
    projects: {
      title: 'Проекты',
    },
    experience: {
      title: 'Опыт работы',
      data_2: {
        company: 'Strongstep',
        position: 'Фронтенд-разработчик',
        period: '2022 - Текущий момент',
        description: "Ведение разработки единой системы дизайна (Ruby on Rails и Figma) для платформы управления проектами. Улучшение визуального привлекательности платформы, опыта пользователя и согласованности (CSS)."
      },
      data_1: {
        company: 'Strongstep',
        position: 'Стажер',
        period: '2022',
        description: 'Проектирование и разработка пользовательских интерфейсов для портала управления проектами, улучшение визуальной привлекательности и опыта пользователя с помощью интегрированных анимаций.'
      }
    },
    education: {
      title: 'Образование',
      data_2: {
        institution: 'Университет Порту',
        degree: 'Магистр мультимедиа',
        period: '2023 - Текущий момент',
        description: 'Исследование различных областей и фокус на развитии навыков дизайна UX/UI для стимулирования инноваций в цифровых опытах.'
      },
      data_1: {
        institution: 'Школа медиа-искусств и дизайна',
        degree: 'Степень веб-разработчика',
        period: '2019 - 2022',
        description: 'Развитие навыков программирования, прототипирования и веб-дизайна. Применение навыков в разработке продуктов для создания привлекательных веб-приложений и мультимедийного контента.'
      }
    },
    translate: {
      current: 'Русский (RU)',
      options: {
        english: 'Английский (США)',
        portuguese: 'Португальский (PT)',
        russian: 'Русский (RU)',
        spanish: 'Испанский (ES)'
      }
    }
  }
}
