export default {
  translations: {
    app: 'Ярослав Максимчик - Фронтенд-разработчик',
    description: 'Фронтенд-разработчик с более чем 2-летним опытом и страстью к дизайну и веб-интерфейсам.',
    accessibility: {
      toggle_theme: 'Переключить тему',
      source_code: 'Исходный код',
    },
    intro: {
      title: 'Ярослав - фронтенд-разработчик с более чем 2-летним опытом и страстью к дизайну и веб-интерфейсам.',
      subtitle: 'Родом из Гродно, живу в Порту. Вдохновляюсь историями, играми и значимыми связями.'
    },
    projects: {
      title: 'Проекты',
      circuit_rush: {
        award: 'Премия Three.js Journey Selection',
        description: 'Минималистическая адреналиновая гоночная игра.',
      },
      globus: {
        description: 'Уникальный глобус для изучения глобальных данных.',
      },
      expns: {
        description: 'Управление финансами, упрощенно.',
      },
      codio: {
        description: 'Сайт веб-агентства дизайна.',
      },
      rorushi: {
        description: 'Просто сайт ресторана суши.',
      },
      movera: {
        description: 'Обновление мобильного UX/UI.',
      }
    },
    experience: {
      title: 'Опыт работы',
      data_3: {
        company: 'CEiiA',
        position: 'Фронтенд-разработчик',
        period: '2024 - Текущий момент',
        description: "Разработка доступных и высокопроизводительных пользовательских интерфейсов для систем управления мобильностью, интегрированных с платформой AYR. Сотрудничество с многофункциональными командами для оптимизации обработки данных, улучшения производительности сервера и обеспечения инклюзивного дизайна для приложений умных городов."
      },
      data_2: {
        company: 'Strongstep',
        position: 'Фронтенд-разработчик',
        period: '2022 - 2024',
        description: "Руководство разработкой единой системы дизайна для платформы управления проектами, улучшение визуальной привлекательности, опыта пользователя и согласованности."
      },
      data_1: {
        company: 'Strongstep',
        position: 'Стажер',
        period: '2022',
        description: 'Проектирование и разработка пользовательских интерфейсов для портала управления проектами, улучшение визуальной привлекательности и опыта пользователя с помощью интегрированных анимаций.'
      }
    },
    education: {
      title: 'Образование',
      data_2: {
        institution: 'Университет Порту',
        degree: 'Магистр мультимедиа',
        period: '2023 - Текущий момент',
        description: 'Диссертация, посвящённая доступности и визуализации данных в интерфейсах, с использованием Three.js для отображения нефтяных пятен на глобусе в рамках европейского проекта ILIAD.'
      },
      data_1: {
        institution: 'Школа медиа-искусств и дизайна',
        degree: 'Степень веб-разработчика',
        period: '2019 - 2022',
        description: 'Развитие навыков программирования, прототипирования и веб-дизайна. Применение навыков в разработке продуктов для создания привлекательных веб-приложений и мультимедийного контента.'
      }
    },
    technologies: {
      title: 'Технологии',
    },
    translate: {
      current: 'Русский (RU)',
      options: {
        english: 'Английский (US)',
        portuguese: 'Португальский (PT)',
        russian: 'Русский (RU)'
      }
    }
  }
}
