export default {
  translations: {
    app: 'Ярослав Максимчик - Фронтенд-разработчик',
    description: 'Фронтенд-разработчик с более чем 2-летним опытом и страстью к дизайну и веб-интерфейсам.',
    accessibility: {
      toggle_theme: 'Переключить тему',
      source_code: 'Исходный код',
    },
    intro: {
      title: 'Ярослав - фронтенд-разработчик с более чем 2-летним опытом и страстью к дизайну и веб-интерфейсам.',
      subtitle: 'Родом из Гродно, живущий в Порту. Источник вдохновения: фильмы, игры и семья.'
    },
    projects: {
      title: 'Проекты',
      circuit_rush: {
        description: 'Минималистическая адреналиновая гоночная игра.',
      },
      globus: {
        description: 'Уникальный глобус для изучения глобальных данных.',
      },
      expns: {
        description: 'Управление финансами, упрощенно.',
      },
      codio: {
        description: 'Сайт веб-агентства дизайна.',
      },
      rorushi: {
        description: 'Просто сайт ресторана суши.',
      },
      movera: {
        description: 'Обновление мобильного UX/UI.',
      }
    },
    experience: {
      title: 'Опыт работы',
      data_2: {
        company: 'Strongstep',
        position: 'Фронтенд-разработчик',
        period: '2022 - Текущий момент',
        description: "Ведение разработки единой системы дизайна (Ruby on Rails и Figma) для платформы управления проектами. Улучшение визуального привлекательности платформы, опыта пользователя и согласованности (CSS)."
      },
      data_1: {
        company: 'Strongstep',
        position: 'Стажер',
        period: '2022',
        description: 'Проектирование и разработка пользовательских интерфейсов для портала управления проектами, улучшение визуальной привлекательности и опыта пользователя с помощью интегрированных анимаций.'
      }
    },
    education: {
      title: 'Образование',
      data_2: {
        institution: 'Университет Порту',
        degree: 'Магистр мультимедиа',
        period: '2023 - Текущий момент',
        description: 'Исследование различных областей и фокус на развитии навыков дизайна UX/UI для стимулирования инноваций в цифровых опытах.'
      },
      data_1: {
        institution: 'Школа медиа-искусств и дизайна',
        degree: 'Степень веб-разработчика',
        period: '2019 - 2022',
        description: 'Развитие навыков программирования, прототипирования и веб-дизайна. Применение навыков в разработке продуктов для создания привлекательных веб-приложений и мультимедийного контента.'
      }
    },
    technologies: {
      title: 'Технологии',
    },
    translate: {
      current: 'Русский (RU)',
      options: {
        english: 'Английский (US)',
        portuguese: 'Португальский (PT)',
        russian: 'Русский (RU)',
        spanish: 'Испанский (ES)'
      }
    }
  }
}
